---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkExtraPumpOutsideSet
source: html/a2f03121-4194-d1c7-722d-9eec61ff478d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkExtraPumpOutsideSet Property

Flow calculations do not calculate this pump together with the other pumps as one equipment set. Verify the flow distribution and add the pump to the equipment set, if desired.

## Syntax (C#)
```csharp
public static FailureDefinitionId NetworkExtraPumpOutsideSet { get; }
```